Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/personal_finance/debt/personal_insolvency/index.html.txt.tmx
Source language: en
Languages: ga

source: Overview Document Personal insolvency options The Personal Insolvency Act 2012 introduced a new system for dealing with personal insolvency
ga: Overview Document Roghanna um Dhócmhainneacht Phearsanta Chuir an tAcht um Dhocmhainneacht Phearsanta córas nua i bhfeidhm chun déileáil le dócmhainneacht phearsanta

source: Insolvency Service of Ireland
ga: Seirbhís Dócmhainneachta na hÉireann

source: The Insolvency Service of Ireland (ISI) administers the debt settlement procedures introduced under the Personal Insolvency Act 2012
ga: Riarann Seirbhís Dócmhainneachta na hÉireann (SDÉ) na nósanna imeachta réitigh fiachais a tugadh isteach faoin Acht um Dhócmhainneacht Phearsanta 2012

source: The Official Assignee in Bankruptcy is based in the ISI and manages its Bankruptcy Division
ga: Tá an Sannaí Oifigiúil i bhFéimheacht lonnaithe sa tSeirbhís agus riarann sé a Rannóg Féimheachta

source: People on very low incomes who cannot pay their debts may apply for a Debt Relief Notice. The qualifying limit has changed from €20,000 to €35,000
ga: Is féidir le daoine ag a bhfuil ísealioncaim nach bhfuil in ann íoc as a bhfiachas iarratas a dhéanamh ar Fhógra um Fhaoiseamh Fiachais

source: People who cannot pay their unsecured debts can apply for a Debt Settlement Arrangement
ga: Is féidir le daoine nach féidir leo a bhfiacha neamhurraithe iarratas a dhéanamh ar Shocrú Réitigh Fiachais

source: People with secured debts who cannot pay their debts can apply for a Personal Insolvency Arrangement
ga: Is féidir le daoine ag a bhfuil fiachas faoi urrús, agus nach bhfuil in ann íoc as a bhfiachas, iarratas a dhéanamh ar Shocrú um Dhócmhainneacht Phearsanta

source: Describes how bankruptcy works in Ireland
ga: Cur síos ar conas a oibríonn féimheacht in Éirinn

source: The rules on bankruptcy have been changed
ga: Tá athruithe tagtha ar na rialacha maidir le féimheacht

source: Most Read in "Money and Tax"
ga: Ábhar is mó éilimh i "Airgead agus Cáin"

source: How your income tax is calculated
ga: An córas le cáin a mheas

source: Universal Social Charge (USC)
ga: Muirear Sóisialta Uilíoch (MSU)

source: Introduction to income tax credits and reliefs
ga: Réamhrá ar chreidmheasanna cánach agus faoiseamh ó cháin ioncaim
